Documents/бит_Предупреждение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_Предупреждение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_ПредупрежденияЖильцам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинСуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектВыбора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПогашения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонИзвещений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветственноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма с учетом переплат. Фактическая сумма долга. Без пени.</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБезПереплат</Name>
							<Comment>Сумма без учета переплат по услугам в разрезе ЛС</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПени</Name>
							<Comment>Сумма начисленной пени</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/бит_ПроживающиеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПроживающиеПоЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусФизЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВладелецКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПрописки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КудаВыписан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткудаПрибыл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравоустанавливающиеДокументы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусФизЛицаДляИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДоляПлощадиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_СтрокаРодствДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьПериодВКопииФЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаРегистрацииДляФЛС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаВыпискиДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ПомещенВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ВПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачислениеПениПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачислениеПениПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДаНет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДаНет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_Предупреждение/Ext/ObjectModule.bsl
#Область ПеременныеМодуля

Перем мВыводитьСуммуБезУчетаПереплатПоУслугам Экспорт; // Хранит флаг настройки ЖКХ.
Перем мВключатьВРасчетСуммыДолгаПени          Экспорт; // Хранит флаг настройки ЖКХ.

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункцииДокумента

// Функция фозвращает дату долга.
//
// Параметры:
//  Организация  - СправочникСсылка - фильтр к запросу.
//
//  Дата         - Дата             - фильтр к запросу.
//
// Возвращаемое значение:
//   Дата   - текущая дата долга.
//
Функция ПолучитьДатуДолга(Организация, Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -(1 + бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени)), МЕСЯЦ) КАК Дата1,
	|	ВЫБОР
	|		КОГДА бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей >= ДЕНЬ(&Дата)
	|			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1 - бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени), МЕСЯЦ)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени), МЕСЯЦ)
	|	КОНЕЦ КАК Дата
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата"       , Дата);
	
	Возврат ?(Запрос.Выполнить().Пустой(), ТекущаяДата(),Запрос.Выполнить().Выгрузить()[0].Дата);
	
КонецФункции

// Функция возвращает список ЛС по ЛС, зданию или организации.
//
// Параметры:
//  <Здание>  - <Справочник.бит_СписокЗданий> - ссылка на справочник.
//  <ФлагЗдания>  - <логическое> - заполнение поля ОбъектВыбора на вид справочника бит_СписокЗданий.
//  <ЛС>  - <Справочник.бит_ЛицевыеСчета> - ссылка на справочник.
//
// Возвращаемое значение:
//   <СписокЛС>   -  ТаблицаЗначенений из ЛС.
//
Функция ПолучитьСписокЛС(Здание = Неопределено,  ФлагЗдания = Ложь, ЛС = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если  ЛС <> Неопределено  Тогда
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|ГДЕ
		|	бит_ЛицевыеСчета.Ссылка = &ЛС";
		
	ИначеЕсли ФлагЗдания Тогда
		Запрос.Текст = 
		
		"ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|ГДЕ
		|	бит_ЛицевыеСчета.Здание = &СписокЗданий
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет";
		
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписокЗданий.Здание
		|ПОМЕСТИТЬ СписокЗданий
		|ИЗ
		|	&СписокЗданий КАК СписокЗданий
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|ГДЕ
		|	бит_ЛицевыеСчета.Здание В
		|			(ВЫБРАТЬ
		|				СписокЗданий.Здание
		|			ИЗ
		|				СписокЗданий КАК СписокЗданий)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет";
		
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("СписокЗданий", Здание);
	Запрос.УстановитьПараметр("ЛС", ЛС);
	
	СписокЛС = Запрос.Выполнить().Выгрузить();
	
	Возврат СписокЛС;
	
КонецФункции

// // Функция возвращает список зданий.
//
// Параметры:
//  <Организация>  - <Справочник.организации> - название организации.
//
// Возвращаемое значение:
//   СписокЗданий   - таблица значений по организации.
//
Функция ПолучитьСписокЗданий(Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СписокЗданий.Ссылка КАК Здание
	|ИЗ
	|	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
	|ГДЕ
	|	бит_СписокЗданий.Организация = &Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	СписокЗданий = Запрос.Выполнить().Выгрузить();
	
	Возврат СписокЗданий;
	
КонецФункции

// Содержит полный список всех необходимых данных.
// Параметр СписокЛС - массив из номеров лицевых счетов по настройкам пользователя.
// Возврат ИтогТЗ - дерево значений из ЛС, отвественных и сумм долгов. 
// Для заполнения табличной части формы документа.
Функция РасчитатьДолги(СписокЛС, МоментРасчет, ДатаРасчетаПени = '00010101000000') Экспорт
	
	МассивУслуг = Новый Массив;
	Если НЕ ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ШаблонИзвещений);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	бит_ШаблоныИзвещенийУслуги.Услуга
		|ИЗ
		|	Справочник.бит_ШаблоныИзвещений.Услуги КАК бит_ШаблоныИзвещенийУслуги
		|ГДЕ
		|	бит_ШаблоныИзвещенийУслуги.Ссылка = &Ссылка";
		Результат = Запрос.Выполнить().Выгрузить();
		МассивУслуг = Результат.ВыгрузитьКолонку("Услуга");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Момент"		, МоментРасчет);
	Запрос.УстановитьПараметр("ДопСписокЛС"	, СписокЛС);
	Запрос.УстановитьПараметр("ДатаДолга"	, КонецДня(?(ЗначениеЗаполнено(ЭтотОбъект.ДатаРасчета),ЭтотОбъект.ДатаРасчета,ЭтотОбъект.Дата)));
	Запрос.УстановитьПараметр("Услуги"		, МассивУслуг);
	
	Если МассивУслуг.Количество() = 0 Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ОтветственноеЛицо,
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет
		|ПОМЕСТИТЬ СписокОтветственных
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет В (&ДопСписокЛС)) КАК бит_ПроживающиеПоЛССрезПоследних
		|ГДЕ
		|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
		|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
		|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	бит_НачислениеПениПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	СУММА(бит_НачислениеПениПоУслугамЖКХОстатки.СуммаПениОстаток) КАК СуммаОстаток,
		|	бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ
		|ПОМЕСТИТЬ ДолгПени
		|ИЗ
		|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Остатки(&Момент {(&Момент)}, ЛицевойСчет В (&ДопСписокЛС)) КАК бит_НачислениеПениПоУслугамЖКХОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачислениеПениПоУслугамЖКХОстатки.ЛицевойСчет,
		|	бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		|				ТОГДА -бит_НачислениеПениПоУслугамЖКХОбороты.СуммаПениОборот
		|		КОНЕЦ) КАК Оплата,
		|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ
		|ПОМЕСТИТЬ ОплатаСДатыДолгаПени
		|ИЗ
		|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(&Момент {(&Момент)}, &ДатаДолга {(&ДатаДолга)}, Регистратор, ЛицевойСчет В (&ДопСписокЛС)) КАК бит_НачислениеПениПоУслугамЖКХОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	СУММА(бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ КАК Услуга
		|ПОМЕСТИТЬ Долг
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(&Момент {(&Момент)}, ЛицевойСчет В (&ДопСписокЛС)) КАК бит_НачисленияПоУслугамЖКХОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		|				ТОГДА -бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Оплата,
		|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Услуга,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
		|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Разовые
		|ПОМЕСТИТЬ ОплатаСДатыДолга
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&Момент {(&Момент)}, &ДатаДолга {(&ДатаДолга)}, Регистратор, ЛицевойСчет В (&ДопСписокЛС)) КАК бит_НачисленияПоУслугамЖКХОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
		|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Долг.ЛицевойСчет,
		|	СУММА(Долг.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(ОплатаСДатыДолга.Оплата) КАК Оплата,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(Долг.СуммаОстаток, 0) + ЕСТЬNULL(ОплатаСДатыДолга.Разовые, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0) < 0
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(Долг.СуммаОстаток, 0) + ЕСТЬNULL(ОплатаСДатыДолга.Разовые, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0)
		|		КОНЕЦ) КАК СуммаБезПереплат,
		|	СУММА(ЕСТЬNULL(Долг.СуммаОстаток, 0) + ЕСТЬNULL(ОплатаСДатыДолга.Разовые, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0)) КАК Сумма,
		|	ВЫБОР
		|		КОГДА Долг.Услуга <> НЕОПРЕДЕЛЕНО
		|			ТОГДА Долг.Услуга
		|		ИНАЧЕ ОплатаСДатыДолга.Услуга
		|	КОНЕЦ КАК Услуга
		|ПОМЕСТИТЬ ИтогоПоДолгу
		|ИЗ
		|	Долг КАК Долг
		|		ПОЛНОЕ СОЕДИНЕНИЕ ОплатаСДатыДолга КАК ОплатаСДатыДолга
		|		ПО Долг.ЛицевойСчет = ОплатаСДатыДолга.ЛицевойСчет
		|			И Долг.Услуга = ОплатаСДатыДолга.Услуга
		|
		|СГРУППИРОВАТЬ ПО
		|	Долг.ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА Долг.Услуга <> НЕОПРЕДЕЛЕНО
		|			ТОГДА Долг.Услуга
		|		ИНАЧЕ ОплатаСДатыДолга.Услуга
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДолгПени.ЛицевойСчет,
		|	СУММА(ЕСТЬNULL(ДолгПени.СуммаОстаток, 0) - ЕСТЬNULL(ОплатаСДатыДолгаПени.Оплата, 0)) КАК СуммаПени,
		|	ВЫБОР
		|		КОГДА ДолгПени.УслугаЖКХ = НЕОПРЕДЕЛЕНО
		|			ТОГДА ОплатаСДатыДолгаПени.УслугаЖКХ
		|		ИНАЧЕ ДолгПени.УслугаЖКХ
		|	КОНЕЦ КАК Услуга
		|ПОМЕСТИТЬ ИтогоПоПени
		|ИЗ
		|	ДолгПени КАК ДолгПени
		|		ПОЛНОЕ СОЕДИНЕНИЕ ОплатаСДатыДолгаПени КАК ОплатаСДатыДолгаПени
		|		ПО ДолгПени.ЛицевойСчет = ОплатаСДатыДолгаПени.ЛицевойСчет
		|			И ДолгПени.УслугаЖКХ = ОплатаСДатыДолгаПени.УслугаЖКХ
		|
		|СГРУППИРОВАТЬ ПО
		|	ДолгПени.ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА ДолгПени.УслугаЖКХ = НЕОПРЕДЕЛЕНО
		|			ТОГДА ОплатаСДатыДолгаПени.УслугаЖКХ
		|		ИНАЧЕ ДолгПени.УслугаЖКХ
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга
		|ПОМЕСТИТЬ СведенияПоУслугам
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Момент, ЛицевойСчет В (&ДопСписокЛС)) КАК бит_СведенияПоУслугамЛССрезПоследних
		|ГДЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ИтогоПоДолгу.СуммаОстаток, 0)) КАК СуммаОстаток,
		|	СУММА(ЕСТЬNULL(ИтогоПоДолгу.Оплата, 0)) КАК Оплата,
		|	СУММА(ЕСТЬNULL(ИтогоПоДолгу.СуммаБезПереплат, 0)) КАК СуммаБезПереплат,
		|	СУММА(ЕСТЬNULL(ИтогоПоДолгу.Сумма, 0)) КАК Сумма,
		|	СписокОтветственных.ОтветственноеЛицо,
		|	СУММА(ЕСТЬNULL(ИтогоПоПени.СуммаПени, 0)) КАК СуммаПени,
		|	СведенияПоУслугам.ЛицевойСчет
		|ИЗ
		|	СведенияПоУслугам КАК СведенияПоУслугам
		|		ЛЕВОЕ СОЕДИНЕНИЕ СписокОтветственных КАК СписокОтветственных
		|		ПО СведенияПоУслугам.ЛицевойСчет = СписокОтветственных.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоПоДолгу КАК ИтогоПоДолгу
		|		ПО СведенияПоУслугам.ЛицевойСчет = ИтогоПоДолгу.ЛицевойСчет
		|			И СведенияПоУслугам.Услуга = ИтогоПоДолгу.Услуга
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоПоПени КАК ИтогоПоПени
		|		ПО СведенияПоУслугам.Услуга = ИтогоПоПени.Услуга
		|			И СведенияПоУслугам.ЛицевойСчет = ИтогоПоПени.ЛицевойСчет
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокОтветственных.ОтветственноеЛицо,
		|	СведенияПоУслугам.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СписокОтветственных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДолгПени
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ОплатаСДатыДолгаПени
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Долг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ОплатаСДатыДолга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ИтогоПоДолгу
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ИтогоПоПени
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СведенияПоУслугам";
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо КАК ОтветственноеЛицо,
		|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет
		|ПОМЕСТИТЬ СписокОтветственных
		|ИЗ
		|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет В (&ДопСписокЛС)) КАК бит_ПроживающиеПоЛССрезПоследних
		|ГДЕ
		|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства = ЗНАЧЕНИЕ(Справочник.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо)
		|	И (бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
		|			ИЛИ бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	бит_НачислениеПениПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	СУММА(бит_НачислениеПениПоУслугамЖКХОстатки.СуммаПениОстаток) КАК СуммаОстаток,
		|	бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ
		|ПОМЕСТИТЬ ДолгПени
		|ИЗ
		|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Остатки(
		|			&Момент {(&Момент)},
		|			ЛицевойСчет В (&ДопСписокЛС)
		|				И УслугаЖКХ В (&Услуги)) КАК бит_НачислениеПениПоУслугамЖКХОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачислениеПениПоУслугамЖКХОстатки.ЛицевойСчет,
		|	бит_НачислениеПениПоУслугамЖКХОстатки.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачислениеПениПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		|				ТОГДА -бит_НачислениеПениПоУслугамЖКХОбороты.СуммаПениОборот
		|		КОНЕЦ) КАК Оплата,
		|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ
		|ПОМЕСТИТЬ ОплатаСДатыДолгаПени
		|ИЗ
		|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.Обороты(
		|			&Момент {(&Момент)},
		|			&ДатаДолга {(&ДатаДолга)},
		|			Регистратор,
		|			ЛицевойСчет В (&ДопСписокЛС)
		|				И УслугаЖКХ В (&Услуги)) КАК бит_НачислениеПениПоУслугамЖКХОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачислениеПениПоУслугамЖКХОбороты.ЛицевойСчет,
		|	бит_НачислениеПениПоУслугамЖКХОбороты.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	СУММА(бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток) КАК СуммаОстаток,
		|	бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ КАК Услуга
		|ПОМЕСТИТЬ Долг
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(
		|			&Момент {(&Момент)},
		|			ЛицевойСчет В (&ДопСписокЛС)
		|				И УслугаЖКХ В (&Услуги)) КАК бит_НачисленияПоУслугамЖКХОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХОстатки.УслугаЖКХ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		|				ТОГДА -бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Оплата,
		|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК Услуга,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
		|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Разовые
		|ПОМЕСТИТЬ ОплатаСДатыДолга
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(
		|			&Момент {(&Момент)},
		|			&ДатаДолга {(&ДатаДолга)},
		|			Регистратор,
		|			ЛицевойСчет В (&ДопСписокЛС)
		|				И УслугаЖКХ В (&Услуги)) КАК бит_НачисленияПоУслугамЖКХОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
		|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	Долг.ЛицевойСчет,
		|	СУММА(Долг.СуммаОстаток) КАК СуммаОстаток,
		|	СУММА(ОплатаСДатыДолга.Оплата) КАК Оплата,
		|	СУММА(ВЫБОР
		|			КОГДА ЕСТЬNULL(Долг.СуммаОстаток, 0) + ЕСТЬNULL(ОплатаСДатыДолга.Разовые, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0) < 0
		|				ТОГДА 0
		|			ИНАЧЕ ЕСТЬNULL(Долг.СуммаОстаток, 0) + ЕСТЬNULL(ОплатаСДатыДолга.Разовые, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0)
		|		КОНЕЦ) КАК СуммаБезПереплат,
		|	СУММА(ЕСТЬNULL(Долг.СуммаОстаток, 0) + ЕСТЬNULL(ОплатаСДатыДолга.Разовые, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0)) КАК Сумма,
		|	ВЫБОР
		|		КОГДА Долг.Услуга <> НЕОПРЕДЕЛЕНО
		|			ТОГДА Долг.Услуга
		|		ИНАЧЕ ОплатаСДатыДолга.Услуга
		|	КОНЕЦ КАК Услуга
		|ПОМЕСТИТЬ ИтогоПоДолгу
		|ИЗ
		|	Долг КАК Долг
		|		ПОЛНОЕ СОЕДИНЕНИЕ ОплатаСДатыДолга КАК ОплатаСДатыДолга
		|		ПО Долг.ЛицевойСчет = ОплатаСДатыДолга.ЛицевойСчет
		|			И Долг.Услуга = ОплатаСДатыДолга.Услуга
		|
		|СГРУППИРОВАТЬ ПО
		|	Долг.ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА Долг.Услуга <> НЕОПРЕДЕЛЕНО
		|			ТОГДА Долг.Услуга
		|		ИНАЧЕ ОплатаСДатыДолга.Услуга
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДолгПени.ЛицевойСчет,
		|	СУММА(ЕСТЬNULL(ДолгПени.СуммаОстаток, 0) - ЕСТЬNULL(ОплатаСДатыДолгаПени.Оплата, 0)) КАК СуммаПени,
		|	ВЫБОР
		|		КОГДА ДолгПени.УслугаЖКХ = НЕОПРЕДЕЛЕНО
		|			ТОГДА ОплатаСДатыДолгаПени.УслугаЖКХ
		|		ИНАЧЕ ДолгПени.УслугаЖКХ
		|	КОНЕЦ КАК Услуга
		|ПОМЕСТИТЬ ИтогоПоПени
		|ИЗ
		|	ДолгПени КАК ДолгПени
		|		ПОЛНОЕ СОЕДИНЕНИЕ ОплатаСДатыДолгаПени КАК ОплатаСДатыДолгаПени
		|		ПО ДолгПени.ЛицевойСчет = ОплатаСДатыДолгаПени.ЛицевойСчет
		|			И ДолгПени.УслугаЖКХ = ОплатаСДатыДолгаПени.УслугаЖКХ
		|
		|СГРУППИРОВАТЬ ПО
		|	ДолгПени.ЛицевойСчет,
		|	ВЫБОР
		|		КОГДА ДолгПени.УслугаЖКХ = НЕОПРЕДЕЛЕНО
		|			ТОГДА ОплатаСДатыДолгаПени.УслугаЖКХ
		|		ИНАЧЕ ДолгПени.УслугаЖКХ
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет,
		|	бит_СведенияПоУслугамЛССрезПоследних.Услуга
		|ПОМЕСТИТЬ СведенияПоУслугам
		|ИЗ
		|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Момент, ЛицевойСчет В (&ДопСписокЛС)) КАК бит_СведенияПоУслугамЛССрезПоследних
		|ГДЕ
		|	бит_СведенияПоУслугамЛССрезПоследних.Использовать = ЗНАЧЕНИЕ(Перечисление.ДаНет.Да)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(ИтогоПоДолгу.СуммаОстаток, 0)) КАК СуммаОстаток,
		|	СУММА(ЕСТЬNULL(ИтогоПоДолгу.Оплата, 0)) КАК Оплата,
		|	СУММА(ЕСТЬNULL(ИтогоПоДолгу.СуммаБезПереплат, 0)) КАК СуммаБезПереплат,
		|	СУММА(ЕСТЬNULL(ИтогоПоДолгу.Сумма, 0)) КАК Сумма,
		|	СписокОтветственных.ОтветственноеЛицо,
		|	СУММА(ЕСТЬNULL(ИтогоПоПени.СуммаПени, 0)) КАК СуммаПени,
		|	СведенияПоУслугам.ЛицевойСчет
		|ИЗ
		|	СведенияПоУслугам КАК СведенияПоУслугам
		|		ЛЕВОЕ СОЕДИНЕНИЕ СписокОтветственных КАК СписокОтветственных
		|		ПО СведенияПоУслугам.ЛицевойСчет = СписокОтветственных.ЛицевойСчет
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоПоДолгу КАК ИтогоПоДолгу
		|		ПО СведенияПоУслугам.ЛицевойСчет = ИтогоПоДолгу.ЛицевойСчет
		|			И СведенияПоУслугам.Услуга = ИтогоПоДолгу.Услуга
		|		ЛЕВОЕ СОЕДИНЕНИЕ ИтогоПоПени КАК ИтогоПоПени
		|		ПО СведенияПоУслугам.Услуга = ИтогоПоПени.Услуга
		|			И СведенияПоУслугам.ЛицевойСчет = ИтогоПоПени.ЛицевойСчет
		|
		|СГРУППИРОВАТЬ ПО
		|	СписокОтветственных.ОтветственноеЛицо,
		|	СведенияПоУслугам.ЛицевойСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СписокОтветственных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ДолгПени
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ОплатаСДатыДолгаПени
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Долг
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ОплатаСДатыДолга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ИтогоПоДолгу
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ИтогоПоПени
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СведенияПоУслугам";
	КонецЕсли;
	
	ИтогТЗ = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	// БИТ ЖКХ 25.06.2020
	Запрос.УстановитьПараметр("Момент"		, КонецДня(ДатаРасчетаПени));
	Запрос.УстановитьПараметр("ДатаДолга"	, ДатаРасчетаПени);

	ИтогПени = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	для каждого стр из ИтогТЗ.Строки цикл
		
	  НайденнаяСтрока = ИтогПени.Строки.Найти(стр.ЛицевойСчет, "ЛицевойСчет" );
	  Если НайденнаяСтрока <> Неопределено Тогда
	    стр.СуммаПени = НайденнаяСтрока.СуммаПени; 
	  КонецЕсли;	
	
	конеццикла;	
	
	Возврат ИтогТЗ;	
	
КонецФункции

// Возвращает доступные варианты печати документа.
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати.
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура("Предупреждение","Печать предупреждения");
	
КонецФункции

Процедура ОбновитьНастройкиЖКХ()  Экспорт
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("ВыводитьСуммуБезУчетаПереплатПоУслугам", Ложь);
	ПараметрыЖКХ.Вставить("ВключатьВРасчетСуммыДолгаПени"         , Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Дата, Организация, ПараметрыЖКХ);
	
	мВыводитьСуммуБезУчетаПереплатПоУслугам = ПараметрыЖКХ.ВыводитьСуммуБезУчетаПереплатПоУслугам;
	мВключатьВРасчетСуммыДолгаПени          = ПараметрыЖКХ.ВключатьВРасчетСуммыДолгаПени;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

#Если Клиент Тогда
	
// Производит замену строк в указанном табличном документе.
//
// Возвращаемое значение:
//  Булево – была ли произведена замена.
//
Функция НайтиИЗаменитьВДокументе(ТабДок, СтрокаПоиска, СтрокаЗамены)
	
	ОбластьЗамены = ТабДок.НайтиТекст(СтрокаПоиска);
	Если ОбластьЗамены = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбластьЗамены.Текст = СтрЗаменить(ОбластьЗамены.Текст, СтрокаПоиска, СтрокаЗамены);
	Возврат Истина;
	
КонецФункции
	
// Функция формирует табличный документ с печатной формой сличительной ведомости
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Табличный документ - печатная форма сличительной ведомости.
//
Функция ПечатьПредупреждения() Экспорт
	
	// Получить параметры настройки.
	
	ОбновитьНастройкиЖКХ();
	
	Макет = ПолучитьМакет("Предупреждение");
	
	ТабДокумент   = Новый ТабличныйДокумент();
	ТабДокумент.КлючПараметровПечати = "МакетПредупреждения";
	ШапкаОбласть  = Макет.ПолучитьОбласть("ОбластьШапка");

	
	Данные = Новый Структура("СтруктурнаяЕдиница, ОтветственноеЛицо", Организация, Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Руководители = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(Дата, Данные);
	
	СтруктураПечати = Новый Структура();
	СтруктураПечати.Вставить("Организация",Организация.Наименование);
	СтруктураПечати.Вставить("ФИОРуководителя",Руководители.Руководитель);
	СтруктураПечати.Вставить("ДолжностьРуководителя",Руководители.РуководительДолжность);
	СтруктураПечати.Вставить("СрокПогашения",Формат(СрокПогашения, "ДФ='dd MMMM yyyy ""г.""'"));
	Если ЗначениеЗаполнено(ДатаРасчета) Тогда
		ДатаПросмотра = ДатаРасчета;
	Иначе	
		ДатаПросмотра = Дата;             
	КонецЕсли; 
	СтруктураПечати.Вставить("ДатаПросмотра",Формат(ДатаПросмотра, "ДФ='dd MMMM yyyy ""г.""'"));
	
	ФормСтрока = "Л = ru_RU; ДП = Истина";
	ПарПредмета="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
	
	Для каждого Строка ИЗ ЛицевыеСчета Цикл
		
		СтруктураПечати.Вставить("ФИО",   Строка.ОтветственноеЛицо);
		СтруктураПечати.Вставить("Адрес", Строка.ЛицевойСчет.Здание.ПочтовыйАдрес + ?(ЗначениеЗаполнено(Строка.ЛицевойСчет.Квартира),", кв. " + Строка(Строка.ЛицевойСчет.Квартира),""));
		// Расчет суммы долга с учетом настроек.
		Если НЕ мВыводитьСуммуБезУчетаПереплатПоУслугам Тогда
			Сумма = Строка.Сумма;
		Иначе
			Сумма = Строка.СуммаБезПереплат;
		КонецЕсли;
		Если мВключатьВРасчетСуммыДолгаПени Тогда
			Сумма = Сумма + Строка.СуммаПени;
		КонецЕсли;
		
		СуммаПрописью = ЧислоПрописью(Сумма,ФормСтрока, ПарПредмета);
		
		СтруктураПечати.Вставить("Сумма", Сумма);
		СтруктураПечати.Вставить("СуммаПрописью", СуммаПрописью);
		
		ШапкаОбласть  = Макет.ПолучитьОбласть("ОбластьШапка");
		ШапкаОбласть.Параметры.Заполнить(СтруктураПечати);
		Для Каждого ТекПараметр Из СтруктураПечати Цикл
			Пока НайтиИЗаменитьВДокументе(ШапкаОбласть, "[" + ТекПараметр.Ключ + "]", ТекПараметр.Значение) Цикл
			КонецЦикла;
		КонецЦикла;
		
		СтрокаПредупреждения = Новый Массив;
		СтрокаПредупреждения.Добавить(ШапкаОбласть);
		
		Если Не ОбщегоНазначенияБПВызовСервера.ПроверитьВыводТабличногоДокумента(ТабДокумент, СтрокаПредупреждения) Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДокумент.Вывести(ШапкаОбласть);
	КонецЦикла;
	
	ТабДокумент.ОбластьПечати = ТабДокумент.Область(1, 2, ТабДокумент.ВысотаТаблицы, ТабДокумент.ШиринаТаблицы);
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДокумент.ПолеСверху = 0;
	ТабДокумент.ПолеСлева  = 0;
	ТабДокумент.ПолеСнизу  = 0;
	ТабДокумент.ПолеСправа = 0;
	
	Возврат ТабДокумент;
	
КонецФункции

// Процедура выполняет печать макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь, НепосредственнаяПечать = Ложь) Экспорт
	
	Печать = Ложь;	
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Область ОбеспечениеПроведенияДокумента

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Проверим правильность заполнения шапки документа.
	ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок);
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ЛицевойСчет"              ,"ЛицевойСчет");
	СтруктураПолей.Вставить("ОтветственноеЛицо"    	   ,"ОтветственноеЛицо");
	СтруктураПолей.Вставить("Сумма"    		           ,"Сумма");
	СтруктураПолей.Вставить("СуммаБезПереплат"         ,"СуммаБезПереплат");
	СтруктураПолей.Вставить("СуммаПени" 				,"СуммаПени");
	
	РезультатЗапросаПоЛС = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ЛицевыеСчета", СтруктураПолей);
	ТаблицаПоЛС          = РезультатЗапросаПоЛС.Выгрузить();
	
	ПроверитьДублиЛС(ТаблицаПоЛС, Отказ, Заголовок);
	
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоЛС, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьДублиЛС(ТаблицаПоЛС, Отказ, Заголовок) 
	
	ТаблицаДублей = ТаблицаПоЛС.Скопировать();
	
	// Подсчитываем количество повторений.
	ТаблицаДублей.Колонки.Добавить("КоличествоПовторений");
	ТаблицаДублей.ЗаполнитьЗначения(1, "КоличествоПовторений");
	
	ТаблицаДублей.Свернуть("ЛицевойСчет", "КоличествоПовторений");
	
	// Если количество повторений > 1, выдаем сообщение об ошибке.
	Если ?(ТаблицаДублей.Количество() > 0, ТаблицаДублей.Итог("КоличествоПовторений") / ТаблицаДублей.Количество(), 0) > 1 Тогда
		
		ТекстСообщенияОбОшибке = "";
		
		// Цикл по каждому найденному повторению.
		Для Каждого СтрокаТаблицыДублей Из ТаблицаДублей Цикл
			
			Если СтрокаТаблицыДублей.КоличествоПовторений = 1 Тогда
				Продолжить; // повторений нет.
			КонецЕсли;
			
			// Добавим перевод строки, если требуется.
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке 
			+ ?(НЕ ЗначениеЗаполнено(ТекстСообщенияОбОшибке), "", "
			|");
			
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке
			+ "В строках №№ "; 
			
			// Выводим номера строк.
			СписокНомеровСтрок = "";
			
			МассивСтрок = ТаблицаПоЛС.НайтиСтроки(Новый Структура("ЛицевойСчет", СтрокаТаблицыДублей.ЛицевойСчет));
			
			Для Каждого Строка Из МассивСтрок Цикл
				СписокНомеровСтрок = СписокНомеровСтрок + ?(НЕ ЗначениеЗаполнено(СписокНомеровСтрок), "", ", ") + Строка.НомерСтроки;
			КонецЦикла;
			
			
			ТекстСообщенияОбОшибке = ТекстСообщенияОбОшибке
			+ СписокНомеровСтрок
			+ " табличной части ""ЛицевойСчет"" указан один и тот же.";
			
		КонецЦикла;
		
		бит_ОбщегоНазначения.ОшибкаПриПроведении(ТекстСообщенияОбОшибке, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеШапки(СтруктураШапкиДокумента, Отказ, Заголовок)
	
	// Укажем, что надо проверить:
	ОбязательныеРеквизитыШапки = "Организация";
	
	СтруктураОбязательныхПолей = Новый Структура(ОбязательныеРеквизитыШапки);
	
	// Теперь вызовем общую процедуру проверки.
	бит_ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоЛС, Отказ, Заголовок)
	
	Для Каждого СтрокаТЧ Из ТаблицаПоЛС Цикл
		Движение = Движения.бит_ПредупрежденияЖильцам.Добавить();
		Движение.Период 			= Дата;
		Движение.ЛицевойСчет 		= СтрокаТЧ.ЛицевойСчет;
		
		Движение.ОтветственноеЛицо 	= СтрокаТЧ.ОтветственноеЛицо;
		
		Если НЕ мВыводитьСуммуБезУчетаПереплатПоУслугам Тогда
			Сумма = СтрокаТЧ.Сумма;
		Иначе
			Сумма = СтрокаТЧ.СуммаБезПереплат;
		КонецЕсли;
		Если мВключатьВРасчетСуммыДолгаПени Тогда
			Сумма = Сумма + СтрокаТЧ.СуммаПени;
		КонецЕсли;
		
		Движение.СуммаПредупреждения	= Сумма;
		Движение.МоментРасчета 			= СтруктураШапкиДокумента.МоментРасчета;
		Движение.ДатаРасчета 			= СтруктураШапкиДокумента.ДатаРасчета;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТЗСписокЛС = ЛицевыеСчета.Выгрузить(,"ЛицевойСчет");
	
	ТЗСписокЛС.Свернуть("ЛицевойСчет");
	
	СписокЛицевыхСчетов = "";
	
	Для каждого Строка Из ТЗСписокЛС Цикл
		
		Если ПустаяСтрока(Строка.ЛицевойСчет.Наименование) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СписокЛицевыхСчетов = "" Тогда
			СписокЛицевыхСчетов = ""+Строка.ЛицевойСчет.Наименование;
		Иначе
			СписокЛицевыхСчетов = ""+СписокЛицевыхСчетов +", " +Строка.ЛицевойСчет.Наименование;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
	МоментРасчета = НачалоМесяца(ТекущаяДата());
	
КонецПроцедуры

#КонецОбласти

#Область ОператорыОсновнойПрограммы

мВыводитьСуммуБезУчетаПереплатПоУслугам = Ложь;
мВключатьВРасчетСуммыДолгаПени          = Ложь;

#КонецОбласти
